{
  "tags": [
    "dirty sanchez",
    "hot carl",
    "rusty trombone",
    "sex",
    "shit",
    "donkey punch",
    "poop",
    "blumpkin",
    "alabama hot pocket",
    "angry pirate"
  ],
  "result_type": "exact",
  "list": [
    {
      "definition": "The cleveland steamer is far more specific than the listings I have seen here. A sexual act by nature (fetish) the cleveland steamer is when one person craps on another person's chest and (very important) then sits down and rocks back and forth like a steam roller.",
      "permalink": "http://cleveland-steamer.urbanup.com/848550",
      "thumbs_up": 20976,
      "author": "admin@jordantate.com",
      "word": "Cleveland Steamer",
      "defid": 848550,
      "current_vote": "",
      "example": "Billy had just gotten out of the shower, so me and John gave min a cleveland steamer.",
      "thumbs_down": 12261
    },
    {
      "definition": "A Cleveland Steamer is one of two acts that are similar for the scatalogically inclined. One is a crude sex act the other a crude break up technique. Both are the same thing.\r\n\r\n1. You take a dump on a lovers chest while or before titty fucking (if that partner is a female.) Generally for the cacaphile only or as a domination and humiliation tool in BDSM games. See also Brown Showers. The steamer part is that it is very probably steaming from the freshness (Moisture rising from it) not to do with \"steamrolling\" it. Then it would have been called a \"Cleveland Steamroller\". It is probably named after Cleveland (Lucky us Clevelanders) because of the brown stripe left behind resembling the brown stripe on the orange Cleveland Browns Football Helmet. If you squish it down and then you spooge on it for syrup it becomes a \"Boston Pancake\". Don't know the origin of Boston in refernce to that act.\r\n\r\n2. Often used as a breakup technique for angry lovers to wait till the other is asleep and dumping on their chest and leaving them to wake in it the morning after. Point made. Sexual intercourse isn't necessary beforehand technically. It is only for extra points with your pals since you obviously are only pretending to be making up and having sex to achieve this goal and are tricking the other person to get even. Usually done without knowledge of the victim if the \"pooper\" wants to escape alive.\r\n\r\n",
      "permalink": "http://cleveland-steamer.urbanup.com/1668322",
      "thumbs_up": 4344,
      "author": "BFitz99",
      "word": "Cleveland Steamer",
      "defid": 1668322,
      "current_vote": "",
      "example": "Tom wanted to break up with Sally after their last fight and he made his point to her by dropping her a Cleveland Steamer and leaving the bedroom.",
      "thumbs_down": 3577
    },
    {
      "definition": "X is a dumb fuck.  A [chili dog] is where you shit on a girl's chest then titty-fuck her.  A cleveland steamer is where (often in the act of a breakup) you have sex with someone, wait for them to fall asleep, take a huge shit on their chest, and leave.  ",
      "permalink": "http://cleveland-steamers.urbanup.com/1625628",
      "thumbs_up": 1569,
      "author": "dookieluv",
      "word": "cleveland steamers",
      "defid": 1625628,
      "current_vote": "",
      "example": "I would never [chili dog] anyone.  However, I gave out a few [cleveland steamers] out in my day.  I shat on their chests and got the fuck out of there.",
      "thumbs_down": 1215
    },
    {
      "definition": "Don't get this shit wrong. A genuine (pronounced gen-u-INE) Cleveland Steamer is specifically the act of:\r\n1) Laying a deuce upon your partners chest, then,\r\n2) Sliding your buttcheeks up and down your partner's chest in a wake of your mud river, AND\r\n3) making an authentic sound of a steam-whistle blowing.\r\nOnly once the steam-whistle has been sounded have you actually completed a realistic and true Cleveland Steamer.",
      "permalink": "http://cleveland-steamer.urbanup.com/3434671",
      "thumbs_up": 1650,
      "author": "Swinger Dave",
      "word": "Cleveland Steamer",
      "defid": 3434671,
      "current_vote": "",
      "example": "\"Wow, i gave my chick a Cleveland Steamer last night.\"\r\n\"Oh yeah, did you do the steam-whistle sound and everything?\"\r\n\"Hellzyeah. Woke the neighbors up and everything!\"",
      "thumbs_down": 1416
    },
    {
      "definition": "EVERYONE seems to have provided either a partially or entirely inaccurate definition of what a Cleveland Steamer actually is. This classic and creative move is indeed a way to ensure that any desired break-up with a particular girl is accomplished without chance of reconciliation! Okay, THIS is how to perfectly execute a Cleveland Steamer: First, get your soon-to-be-ex drunk to the point of passing out. This serves two purposes. One, it allows you to precisely carry out the defecation on her chest without protest. Two, it almost assures that, because she drank so damn much, she will be even MORE sickened by the stench when she wakes in the morn. But back to the instructions. After passing out, the victim (girl) must be carefully placed in her bed with the covers pulled back. At this time, strip off her top and lay the longest, smokiest and smelliest logs possible directly on, around and between her tits. One may prep for this by eating lots of green vegetables, collard greens in particular, then smoking a pack of menthol cigarettes and eating jalapeno poppers at the same time. After dropping your shit pudding on her chest, and this is very important, pull the covers (preferably including at least two wool blankets and a down comforter) up over her head. If need be, leave her nostrils uncovered so that she won't suffocate. Then, after \"blanketing\" the smoking poo on her chest with as many covers as are available, turn the thermostat in her room up as high as it will go. If you can run that heat upwards of 90-95 degrees, DO IT! After a night of her poo pot pie literally baking on her chest under the multi-layered covers AND with a room temp of around 90 degrees, she will indeed wake to the smell in this steamy sauna of shit that will make her WISH she was engulfed by the smell of something much more tolerable, like the stench of rotting possum carcasses in the desert heat. THIS, my friends, is the REAL Cleveland Steamer!!!",
      "permalink": "http://cleveland-steamer.urbanup.com/4153168",
      "thumbs_up": 560,
      "author": "Larry Tird",
      "word": "Cleveland Steamer",
      "defid": 4153168,
      "current_vote": "",
      "example": "\"I hated Candace's sorry ass so much that I thought I was actually gonna have to kill her to get rid of that nagging bitch once and for all. Fortunately, I cleverly decided to use the ole Cleveland Steamer ploy, which both got rid of her for good and kept me from going to prison! Cleveland Steamers rock, man!!!\"",
      "thumbs_down": 411
    },
    {
      "definition": "The vengeful act of crapping on a lover's chest while they sleep. ",
      "permalink": "http://cleveland-steamer.urbanup.com/3303521",
      "thumbs_up": 921,
      "author": "MC Flunk",
      "word": "Cleveland Steamer",
      "defid": 3303521,
      "current_vote": "",
      "example": "Cleveland Steamer Haiku:\r\n\r\nWake up sleepy head\\\r\nRise and shine bright morning day\\\r\nHey! who crapped on me?\\",
      "thumbs_down": 804
    },
    {
      "definition": "to take a shit on your partners chest after sex. its more of a fetish thing.",
      "permalink": "http://cleveland-steamer.urbanup.com/3904134",
      "thumbs_up": 342,
      "author": "seth9480",
      "word": "cleveland steamer ",
      "defid": 3904134,
      "current_vote": "",
      "example": "dude,this bitch gave me a Cleveland steamer last night.\r\nman thats nasty.",
      "thumbs_down": 253
    },
    {
      "definition": "The art of one person excreting onto someones chest and then rocking backward and forth in a rocking horse motion thus smearing faeces all over the target area.",
      "permalink": "http://cleveland-steamer.urbanup.com/2252841",
      "thumbs_up": 783,
      "author": "James 'Cleveland' Purchase",
      "word": "Cleveland steamer",
      "defid": 2252841,
      "current_vote": "",
      "example": "I met her in a bar, we went back to hers, and upon turning the light on i noticed she had plastic sheets, inquisitive at first i carried on. There was some foreplay and then she shat on my chest. She asked me afterwards if i enjoyed the cleveland steamer.",
      "thumbs_down": 710
    },
    {
      "definition": "the procedure of one sexual partner (man or woman) taking a shit on the chest area of the other partner (man or woman).",
      "permalink": "http://cleveland-steamer.urbanup.com/1706517",
      "thumbs_up": 318,
      "author": "Angela Lopez",
      "word": "cleveland steamer",
      "defid": 1706517,
      "current_vote": "",
      "example": "That cleveland steamer you gave me last night was extra hot, i can still feel the steam from under the sheets last night.",
      "thumbs_down": 255
    },
    {
      "definition": "the act of taking a doo-doo on your partners chest either during sex(usually titty fucking) or after he/she has fallen asleep.  You then proceed to roll around and flatten the doo-doo pie out like a steamroller.  Usually after this you want to run away.",
      "permalink": "http://cleveland-steamer.urbanup.com/1201816",
      "thumbs_up": 1052,
      "author": "Nick Nicholson",
      "word": "cleveland steamer",
      "defid": 1201816,
      "current_vote": "",
      "example": "i was afraid of breaking up with Jen face to face, so i gave her a cleveland steamroller after she fell asleep and ditched.",
      "thumbs_down": 992
    }
  ],
  "sounds": [
    "http://media.urbandictionary.com/sound/clevelandsteamer-5162.mp3",
    "http://api.twilio.com/2008-08-01/Accounts/ACd09691b82112e4b26fce156d7c01d0ed/Recordings/RE1dc13d7da23ae5023d4ab64c83daab2c.mp3",
    "http://api.twilio.com/2008-08-01/Accounts/ACd09691b82112e4b26fce156d7c01d0ed/Recordings/RE32821051fa6faf01616fea79c11c8e4c.mp3",
    "http://api.twilio.com/2008-08-01/Accounts/ACd09691b82112e4b26fce156d7c01d0ed/Recordings/RE073fbf5efe5dedf346a8998cd55f0edd.mp3",
    "http://wav.urbandictionary.com/clevelandsteamer-26426.wav",
    "http://wav.urbandictionary.com/clevelandsteamer-27008.wav",
    "http://wav.urbandictionary.com/clevelandsteamer-27275.wav",
    "http://wav.urbandictionary.com/clevelandsteamer-27343.wav",
    "http://wav.urbandictionary.com/clevelandsteamer-29833.wav",
    "http://wav.urbandictionary.com/clevelandsteamer-30635.wav",
    "http://wav.urbandictionary.com/clevelandsteamer-30636.wav",
    "http://wav.urbandictionary.com/clevelandsteamer-31246.wav",
    "http://wav.urbandictionary.com/clevelandsteamer-31893.wav",
    "http://wav.urbandictionary.com/clevelandsteamer-31894.wav",
    "http://wav.urbandictionary.com/clevelandsteamer-32031.wav",
    "http://api.twilio.com/2008-08-01/Accounts/ACd09691b82112e4b26fce156d7c01d0ed/Recordings/REd286dbcd94cd46ecdb7470168a44eb6d.mp3",
    "http://wav.urbandictionary.com/clevelandsteamer-33628.wav",
    "http://wav.urbandictionary.com/clevelandsteamer-33897.wav",
    "http://wav.urbandictionary.com/clevelandsteamer-34260.wav",
    "http://wav.urbandictionary.com/clevelandsteamer-34301.wav",
    "http://wav.urbandictionary.com/clevelandsteamer-34416.wav",
    "http://wav.urbandictionary.com/clevelandsteamer-34426.wav",
    "http://wav.urbandictionary.com/clevelandsteamer-35543.wav",
    "http://wav.urbandictionary.com/clevelandsteamer-35914.wav",
    "http://wav.urbandictionary.com/clevelandsteamer-36158.wav",
    "http://wav.urbandictionary.com/clevelandsteamer-37964.wav",
    "http://wav.urbandictionary.com/clevelandsteamer-40247.wav",
    "http://wav.urbandictionary.com/clevelandsteamer-40420.wav",
    "http://wav.urbandictionary.com/clevelandsteamer-40580.wav",
    "http://wav.urbandictionary.com/clevelandsteamer-40581.wav",
    "http://wav.urbandictionary.com/clevelandsteamer-41099.wav",
    "http://wav.urbandictionary.com/clevelandsteamer-41108.wav",
    "http://wav.urbandictionary.com/clevelandsteamer-41315.wav",
    "http://wav.urbandictionary.com/clevelandsteamer-41806.wav",
    "http://wav.urbandictionary.com/clevelandsteamer-42181.wav",
    "http://wav.urbandictionary.com/clevelandsteamer-42520.wav"
  ]
}